iPig/src/Reports/ЛистОпороса/ЛистОпороса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ЛистОпороса</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧОпорос</name>
    <attributes>
      <name>НомерОпороса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЖивотного</name>
      <type>
        <types>CatalogRef.НомерЖивотного</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПредпологаемогоОпороса</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОпороса</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Живорожденные</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Мертвые</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Слаборожденные</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Муммии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Свинки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Report>

iPig/src/InformationRegisters/ПоследнееСобытие/ПоследнееСобытие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПоследнееСобытие</name>
  <attributes>
    <name>НомерОпороса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УшнойВыщип</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЖивотногоХряк</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </attributes>
  <dimensions>
    <name>НомерЖивотного</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВвода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПоследнегоСобытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПоследнееСобытие</name>
    <type>
      <types>EnumRef.ПоследнееСобытие</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iPig/src/Enums/ПоследнееСобытие/ПоследнееСобытие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПоследнееСобытие</name>
  <enumValues>
    <name>Случка</name>
  </enumValues>
  <enumValues>
    <name>УЗИ</name>
  </enumValues>
  <enumValues>
    <name>Опорос</name>
  </enumValues>
  <enumValues>
    <name>Отъем</name>
  </enumValues>
  <enumValues>
    <name>Ввод</name>
  </enumValues>
  <enumValues>
    <name>Выбытие</name>
  </enumValues>
  <enumValues>
    <name>Аборт</name>
  </enumValues>
</mdclass:Enum>

iPig/src/Reports/ЛистОпороса/Forms/ФормаОтчета/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Отчет.Период.Вариант = ВариантСтандартногоПериода.ЭтаНеделя; 
	ПериодПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПериодПриИзмененииНаСервере()  
	Отчет.ТЧОпорос.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПоследнееСобытиеРег.НомерОпороса КАК НомерОпороса,
	               |	ПоследнееСобытиеРег.НомерЖивотного КАК НомерЖивотного,
	               |	ДОБАВИТЬКДАТЕ(ПоследнееСобытиеРег.ДатаПоследнегоСобытия, ДЕНЬ, &ДнейДоОпороса) КАК ДатаПредпологаемогоОпороса
	               |ИЗ
	               |	РегистрСведений.ПоследнееСобытие КАК ПоследнееСобытиеРег
	               |ГДЕ
	               |	ПоследнееСобытиеРег.ПоследнееСобытие = ЗНАЧЕНИЕ(Перечисление.ПоследнееСобытие.Случка)
	               |	И ДОБАВИТЬКДАТЕ(ПоследнееСобытиеРег.ДатаПоследнегоСобытия, ДЕНЬ, &ДнейДоОпороса) МЕЖДУ &ДатаНач И &ДатаКон
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаПредпологаемогоОпороса";
	Запрос.УстановитьПараметр("ДнейДоОпороса",Константы.ПериодСупоросностиСвиноматки.Получить());
	Запрос.УстановитьПараметр("ДатаНач",Отчет.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон",Отчет.Период.ДатаОкончания);
	Отчет.ТЧОпорос.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ПериодПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПредварительныйПросмотр(Команда)
	ТабДок = Новый ТабличныйДокумент;
	ПечатьПредварительныйПросмотр(ТабДок);
	ТабДок.ОтображатьСетку 		= Ложь;
	ТабДок.Защита 				= Ложь;
	ТабДок.ТолькоПросмотр 		= Ложь;
	ТабДок.ОтображатьЗаголовки 	= Ложь;
	ТабДок.ОриентацияСтраницы 	= ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб			= Истина;
	ТабДок.Показать();
КонецПроцедуры


&НаСервере
Процедура ПечатьПредварительныйПросмотр(ТабДок)
	Макет = Отчеты.ЛистОпороса.ПолучитьМакет("ПредварительныйПросмотр");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");	                             	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка"); 
	ОбластьШапка.Параметры.Период = Формат(Отчет.Период.ДатаНачала,"ДФ=dd.MM.yy")  + " - " + Формат(Отчет.Период.ДатаОкончания,"ДФ=dd.MM.yy"); 
	ОбластьШапка.Параметры.КоличествоЖивотных = Отчет.ТЧОпорос.Количество();
	ТабДок.Вывести(ОбластьШапка);
	//
	//ЗаписиСписка = ПолучитьТЗИзСписка(); 
	////	ЗаписиСписка.Сортировать("ДатаСлучки");
	Для Каждого СтрЗаписи ИЗ Отчет.ТЧОпорос Цикл  
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры,СтрЗаписи);
		ТабДок.Вывести(ОбластьСтрока);
	КонецЦикла;	  
КонецПроцедуры
